[
  {
    "year": "2022",
    "month": "April",
    "endDate": "Present",
    "role": "Senior Application Developer",
    "company": "ADP",
    "location": "Atlanta, GA",
    "description": [
      "Led end-to-end design and implementation of automated detection and resolution policies for 10+ payroll anomalies, serving 500+ enterprise clients while reducing manual intervention significantly.",
      "Architected scalable frameworks for anomaly detection and resolution services with MySQL backends and Redis caching for high-performance data retrieval.",
      "Engineered seamless inter-service communication through message queues and built comprehensive REST APIs for robust anomaly management.",
      "Extended platform capabilities by integrating EA-Specs and gateway connections, enabling multi-organization payroll anomaly support across ADP infrastructure.",
      "Spearheaded optimization of the Pi Test Runner application—designed MySQL metrics storage within Spring Boot, reducing analysis time and troubleshooting cycles.",
      "Leveraged Gradle for intelligent dependency and build management, delivering a 30% reduction in development time across the team.",
      "Implemented asynchronous Spring-based communication patterns, achieving a 10% boost in application performance.",
      "Elevated code quality through SonarQube-driven refactoring, eliminating vulnerabilities and duplicates to reach 90% code coverage.",
      "Automated Excel-to-database pipelines using Apache POI and Java, enabling end users to visualize and filter payroll data dynamically.",
      "Mentored junior developers and conducted rigorous code reviews to establish and maintain engineering excellence standards."
    ]
  },
  {
    "year": "2016",
    "month": "December",
    "endDate": "September 2019",
    "role": "Specialist Programmer",
    "company": "Infosys Private Ltd.",
    "location": "Bengaluru, KA",
    "description": [
      "Completed rigorous 6-8 month intensive training in Java, SQL, NoSQL databases, Spring & Spring Boot architectures, and Scala & Akka frameworks.",
      "Built data management applications that seamlessly transmitted multi-service data to client applications via RESTful web services, enhancing system reliability.",
      "Designed and integrated REST APIs for mobile retail applications that served over 1 million users monthly with consistent uptime.",
      "Engineered robust backend systems interfacing with microservices and Oracle SQL databases, driving operational efficiency improvements.",
      "Implemented intelligent Spring-based caching solutions that reduced database query response times by 30%.",
      "Ensured code quality through comprehensive JUnit and Jacoco testing, achieving 90% test coverage across all modules.",
      "Developed high-performance RESTful APIs using Java and Spring Boot that reduced load times by 30% and enabled seamless cross-platform data integration."
    ]
  }
]
